In [1]:
import sqlite3
import pandas as pd

In [2]:
# define connection and cursor
conn = sqlite3.connect('store_transactions.db')
c = conn.cursor()

In [3]:
#create table stores
create_table_1 = """
CREATE TABLE IF NOT EXISTS stores
(
store_id    INTEGER   PRIMARY KEY, 
location    TEXT      NOT NULL, -- variable length: string (slow), Also VARCHAR
brand       CHAR(2)   NOT NULL -- fixed length: string
);
"""

create_table_2 = """
CREATE TABLE IF NOT EXISTS purchases
(
purchase_id     INTEGER         PRIMARY KEY, 
store_id        INTEGER         NOT NULL, 
total_cost      DECIMAL(6,2)    NOT NULL,
FOREIGN KEY(store_id) REFERENCES stores(store_id)
);
"""
c.execute(create_table_1)
c.execute(create_table_2)

In [4]:
#add to stores
insert_val = """
INSERT INTO stores
(store_id, location, brand)
VALUES 
(21, 'Minneapolis, MN', 'brand1'),
(95, 'Chicago, IL', 'brand2'),
(64, 'Iowa City, IA', 'brand33');
"""
c.execute(insert_val)

In [5]:
#add to purchases
c.execute("INSERT INTO purchases VALUES (54, 21, 15.4)")
c.execute("INSERT INTO purchases VALUES (23, 64, 21.12)")

In [6]:
#get results
pd.read_sql_query("SELECT * FROM stores", conn)

   store_id         location    brand
0        21  Minneapolis, MN   brand1
1        64    Iowa City, IA  brand33
2        95      Chicago, IL   brand2

In [7]:
retrieve = """
SELECT * FROM purchases
LIMIT 5;
"""
pd.read_sql_query(retrieve, conn)

   purchase_id  store_id  total_cost
0           23        64       21.12
1           54        21       15.40

In [8]:
#update
c.execute("UPDATE purchases SET total_cost = 3.67 WHERE purchase_id = 54")

In [9]:
pd.read_sql_query("SELECT * FROM purchases", conn)

   purchase_id  store_id  total_cost
0           23        64       21.12
1           54        21        3.67

In [10]:
pd.read_sql_query("SELECT * FROM stores", conn)

   store_id         location    brand
0        21  Minneapolis, MN   brand1
1        64    Iowa City, IA  brand33
2        95      Chicago, IL   brand2